#############################  DATA Layer  #############################
name: "deep_age"
layer {
	top: "data"
	top: "label"
	name: "data"
	type: "Data"
	data_param {
		source: "../lmdb/train_lmdb"
		backend:LMDB
		batch_size: 32
	}
	transform_param {
	mirror: true
	}
	include: { phase: TRAIN }
}

layer {
	top: "data"
	top: "label"
	name: "data"
	type: "Data"
	data_param {
		source: "../lmdb/val_lmdb"
		backend:LMDB
		batch_size: 32
	}
	transform_param {
	mirror: true
	}
	include: { phase: TEST }
}

#############################  CONV NET 1 #############################
layer {
  name: "scale"
  top: "scale"
  bottom: "data"
  type: "Scale"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    filler {
      value: 0.007843137
    }
    bias_term: true
    bias_filler {
      value: -1
    }
  }
}
layer {
	name: "conv1"
	type: "Convolution"
	bottom: "scale"
	top: "conv1"
	param {
		name: "conv1_w"
		lr_mult: 1
		decay_mult: 1
	}
	param {
		name: "conv1_b"
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 20
		kernel_size: 3
		stride: 1
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	bottom: "conv1"
	top: "conv1"
	name: "bn_conv1"
	type: "BatchNorm"
}

layer {
	bottom: "conv1"
	top: "conv1"
	name: "scale_conv1"
	type: "Scale"
	scale_param { bias_term: true}
}

layer {
	name: "relu1"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
layer {
	name: "pool1"
	type:  "Pooling"
	bottom: "conv1"
	top: "pool1"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}
layer {
	name: "conv2"
	type: "Convolution"
	bottom: "pool1"
	top: "conv2"
	param {
		name: "conv2_w"
		lr_mult: 1
		decay_mult: 1
	}
	param {
		name: "conv2_b"
		lr_mult: 2
		decay_mult: 0
	 }
	convolution_param {
		num_output: 40
		kernel_size: 3
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	bottom: "conv2"
	top: "conv2"
	name: "bn_conv2"
	type: "BatchNorm"
}

layer {
	bottom: "conv2"
	top: "conv2"
	name: "scale_conv2"
	type: "Scale"
	scale_param { bias_term: true}
}
layer {
	name: "relu2"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
}
layer {
	name: "pool2"
	type:  "Pooling"
	bottom: "conv2"
	top: "pool2"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}

layer {
	name: "conv3"
	type: "Convolution"
	bottom: "pool2"
	top: "conv3"
	param {
		name: "conv3_w"
		lr_mult: 1
		decay_mult: 1
	}
	param {
		name: "conv3_b"
		lr_mult: 2
		decay_mult: 0
	}
	convolution_param {
		num_output: 60
		kernel_size: 3
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	bottom: "conv3"
	top: "conv3"
	name: "bn_conv3"
	type: "BatchNorm"
}

layer {
	bottom: "conv3"
	top: "conv3"
	name: "scale_conv3"
	type: "Scale"
	scale_param { bias_term: true}
}
layer {
	name: "relu3"
	type: "ReLU"
	bottom: "conv3"
	top: "conv3"
}
layer {
	name: "pool3"
	type:  "Pooling"
	bottom: "conv3"
	top: "pool3"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride: 2
	}
}
layer {
	name: "conv4"
	type: "Convolution"
	bottom: "pool3"
	top: "conv4"
	param {
		name: "conv4_w"
		lr_mult: 1
		decay_mult: 1
	}
	param {
		name: "conv4_b"
		lr_mult: 2
		decay_mult: 0
	 }
	convolution_param {
		num_output: 80
		kernel_size: 3
		pad: 1
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	bottom: "conv4"
	top: "conv4"
	name: "bn_conv4"
	type: "BatchNorm"
}

layer {
	bottom: "conv4"
	top: "conv4"
	name: "scale_conv4"
	type: "Scale"
	scale_param { bias_term: true}
}
layer {
	name: "relu4"
	type: "ReLU"
	bottom: "conv4"
	top: "conv4"
}
layer {
	name: "pool4"
	type:  "Pooling"
	bottom: "conv4"
	top: "pool4"
	pooling_param {
		pool: MAX
		kernel_size:2
		stride:2
	}
}
layer {
	name: "deepid"
	type:  "InnerProduct"
	bottom: "pool4"
	top: "deepid"
	param {
	name: "fc5_w"
	lr_mult: 1
	decay_mult: 1
}
	param {
		name: "fc5_b"
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
		num_output: 160
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "relu6"
	type: "ReLU"
	bottom: "deepid"
	top: "deepid"
}
#layer {
#	name: "drop6"
#	type:  "Dropout"
#	bottom: "deepid"
#	top: "deepid"
#	dropout_param {dropout_ratio: 0.1}
#}
layer {
	name: "fc7"
	type:  "InnerProduct"
	bottom: "deepid"
	top: "fc7"
	param {
		name: "fc7_w"
		lr_mult: 1
		decay_mult: 1
	}
	param {
		name: "fc7_b"
		lr_mult: 2
		decay_mult: 0
	}
	inner_product_param {
	num_output: 5
		weight_filler {
			type: "xavier"
		}
		bias_filler {
			type: "constant"
			value: 0.1
		}
	}
}
layer {
	name: "accuracy"
	type:  "Accuracy"
	bottom: "fc7"
	bottom: "label"
	top: "accuracy"
}
layer {
	name: "loss"
	type:  "SoftmaxWithLoss"
	bottom: "fc7"
	bottom: "label"
	top: "loss"
}

