如何将自己的思路变清晰：
        对象 + 操作         现有对象在有操作

        对象之间的关系：
                父子关系        兄弟关系


        思考整个东西的发现过程：
                发现的方法：    
                    由已知求未知
                    设置未知 限制条件来求

                    分步简化问题


        将问题 转化看成一样的。。。。。
            ：  1 2 0   是否可以为数列
                找到一个通项公式变可以证明为 一个数列
                因为有三个解确定一个方程    故设二次方程
                求二次方程便可

            怎么求思考


怎么更快的了解一个领域 比较前沿的领域:
    比如 RBM
    论文:
        难度的维度:
            先搜索 学术论文 Introduction
                    An Introduction to Restricted Boltzmann Machines
        语言的维度: 
            Chinese     English
    博客:
        ....


















