CTRL-W j 把光标向下移动 N 个窗口。用光标的位置在若干窗口之间做出选择。

CTRL-W k 把光标向上移动 N 个窗口。用光标的位置在若干窗口之间做出选择。

CTRL-W h 把光标向左移动 N 个窗口。用光标的位置在若干窗口之间做出选择。

CTRL-W l 把光标向右移动 N 个窗口。用光标的位置在若干窗口之间做出选择。

CTRL-W w 如果没有添加计数，则将光标移动到当前窗口的右/下方的窗口。如果
  右/下方没有窗口，就移动到左上角的窗口。

CTRL-W W 如果没有添加计数，则将光标移动到当前窗口的左/上方的窗口。如
  果左/上方没有窗口，就移动到右下角的窗口。

CTRL-W t 把光标移动到左上角的窗口。

CTRL-W b 把光标移动到右下角的窗口。

CTRL-W p 移动到前一个 (previous) (上次访问的) 窗口。

CTRL-W P 移动到预览窗口。如果没有预览窗口就会出错。搜索

另外用命令模式也可以，将CTRL-W换成:wincmd
例如：wincmd j   就是将光标移动到下方的窗口

可以:h wincmd 查看帮助文档









