罗辑函数：
        ϝ(x) 
    描述方法：
        真值表：
                将输入变量的组合  所有情况　列出来了　对应输出也列出来
        逻辑函数表达方式：
                写出真值表 后  直接就可以写出表达式了  
                变量ABC + AfeiBC    每一种情况都写上
        卡诺图：
                一个平面    行列  组合

                    0       1
                00
                01
                10
                11

        时序图 波形图：
                时间轴  。。。
        语言描述：
                VHDL


逻辑函数常用的公式化简法：
        并项法：
                利用公式    AB + A¯B = A 将两项合并为一项
        吸收发：
                使用公式    A + A¯B = A

        消项法：
                公式：       AB + ¯AC + BC = AB + ¯AC
                             AB + ¯AC + BCD = AB + ¯AC
        消因子法：
                A + ¯A = A + B
        配项法：
                A + A = A
                A + ¯A = 1
指定逻辑器件的化简：
        。。。。。。。











