什么是梦想:
        内心深处的最深切的渴望


$是 想  出来的


反废物测试理解与应用:
        啊名,你对我这么好 是不是喜欢我啊!
        我们只是朋友  我觉得我们不太适合 我们做朋友比较好
        啊名,要是你在高一点的话,就好了          废物测试
            为什么啊! 你要是再高一点的话 我就做你女朋友

    废物测试:       赛选男人系统    男人:吹牛逼(不建议)
        当你做出了足够的高价值展现,满足了对方核心需求所缺乏的特质,
                那么女人开始对你有感觉,就会刨处废物测试
        如果你没有展示价值, 你基本是没希望看到废物测试的
            
            可以回答: 我很矮 但是我很温柔

        如果对你说了 那是好事,说明对你有感觉了 被你吸引了

        你在酒吧和一个漂亮妹子搭上了, 她说: "我渴了, 如果请我喝一杯把"
            1 可以啊 没问题         老好人 当你不给买的时候 ....
            2 凭什么 我又不欠你
            3 没问题 但是你要给我一个理由 为什么我该请你喝一杯
                你和一般的男生不一样 
                更自信
                幽默感
                把她代入到你的框架里面来

                平衡
                
                我很漂亮啊    这个理由勉强可以 向你这么自信的女生 我已经很少
                    见了, 喝酒 你平常交流的时候 都是这么自信码
                你这个理由 太敷衍了 不成立  你还是自己买吧
            开始交流之后 会抛出各种废物测试 考虑以后的发展
        你和她刚认识半个小时,她给你说: 我只喜欢成熟的男生
            1 我虽然不高 但是我也不算太小孩子气 上一次...说一个列子
                承认自己不足(掉价),说起他的优势  说完拜拜
            2 我看你反转了吧 你比我还小孩子气
            3 我看你就像我那个4岁的表妹,非常可爱,但总是喜欢引起注意 下次我
                给你卖一个那种带小风扇的帽子,那一定非常适合你!
                我把你当妹妹,没有喜欢你 反过来调侃你一下 你刚刚说的过分了
                    不喜欢
                通过社交抗压能力 测试
                    调侃

        星期天不知道有没有时间,有时间再去把!  
            这样说找死啊, 别人一定说拜拜   
            要说去(果断)  当天真有事 明天一定去(准备一个精巧礼物 赔罪) 
                别人通情达理  

        你在聊天一段 时间后, 终于,这个女生看着你的眼睛,问你: 你是不是喜欢我
            她已经知道 你在追她了 你回答知道 不知道都失败了
                如果回答是 那么她就会站在主要位置 掌握主动权 让你干嘛干嘛
            1 我只是享受和你聊天而已    直接拒绝
            2 你还是别抱太多的希望了 我没那么容易的     
                你给她定位 我不拒绝你 我也不答应你
                你还给她一个合理的追你的借口呢
            3 为什么你会这样想呢


                    







人际交往话题制造与延伸:
    开场白:
            经常: 你好  我是...
                 你好 在干吗...


            当你主动去和别人交流时, 给别一人一个安心的理由 可以赞美对方优点
            陌生人: 
                你好,我觉得你很有气质,所以冒险过来认识你
                    我只喜欢和比我高的男生交朋友
                    这么巧,我也只喜欢比我高的女生交朋友

                    千万不要认真,认真就输了啊  跳出测试
                    #你怎么和我女朋友一样啊 老是高一些奇怪的事
                    #我心高
                嘿,我想认识你,但我觉得没有好的方法,所以就直接郭莱跟你打招呼,
                    我叫XXX     如果我加了你微信之后,你觉得我是个坏人的话
                                可以把我删了
                    
                找美女问路:
                    你好 不要意思,打扰一下,你知道附近的银行怎么走码
                    
            同学,同事:
                你好,你走路的姿势很优雅,你以前学过跳舞把 
                嘿,你好,这本书或电影好看码?
    寻找兴趣点:
            沟通三部曲:
                聆听 发问 讲故事
                男生与女生的兴趣爱好:   电影 美食 宠物(女生)
                                        事业 运动 学习(男生)
                        大部分的女生都喜欢有事业心的男生
                聆听: 发问女生的兴趣爱好 去聆听  你为什么会喜欢这个?
                            你最美好的回忆是什么?
                            当女生回忆完之后 讲故事:回忆童年 讲小时的故事
    沟通态度:
            认真 听 是不是点头同意
            点头认真听
    破解尴尬的万能招:
            我知道你下一句要说什么,你信吗?
            你看你脸上有东西,无厘头的喜剧效果
    沟通技巧方式都有一个前提:
            个人形象:
            展示面:让别人看到你的展示面 高价值


沟通交往的主动性:
        主动意识:
                只有主动追求的东西才能到手
                你选择了什么样的人生,你就选择了什么样的路
                主动初级就是最好的防守
        主动出击:
        主动追求:
        主动去追求一些事情之后会遇到的问题


        你好,我在那边看到你,觉得你很有气质,所以我冒险过来想跟你认识下,如果
            我不过来的话我觉得我会后悔一辈子的  广场公园..

        你号 我在那边看到你,特别的想认识你,我觉的直接过来打声招呼
            是最好的办法,所以我就冒险过来了

            


















