财富法则:
        你收入的增长成度与你的付出成度正比


        大多数人都没有内在的能力创造并持有大笔资金,无法应对与金钱有关的
            与日俱增的挑战. 朋友,这就是他们不能拥有大笔财富的主要原因.

        如果想要改变果实,你就得首先改变它的根.
            如果想要改变有形的东西,首先得从无形处着手.

        金钱是结果,财富是结果,健康是记过,疾病是结果,你的体重也是结果,我们
            生活在因果世界之中.

        思想产生感触,感触产生行动,行动产生结果

        但当人的潜意识必须在根深蒂固的情感和逻辑之间做出选择的话,情感几乎
            总是占了上风.

        你可以选择有利于自己的幸福与成功的思维方式,而不是相反

        在需要钱的地方,金钱极为重要,而不在需要它的地方,他就显得为不知道了

        当你抱怨的时候,你就成了一个活生生的,吸入不公平之类东西的磁铁

        没有那个富人是真正的受害者
            要承认你生活的里里外外都是自己创造的.要意识到,有没有财富,都是
                自己造的.

        富人玩金钱游戏是为了获胜
        穷人玩金钱游戏是为了不输
            穷人在防守,而不是在进攻

        如果你的目标是为了过得舒适,那么你是永远不会成为有钱人的,但如果你的
            目标是为想变成有钱人,那么你的生活就会过得极为舒适.

        富人以行动致富
        穷人靠梦想致富

        如果你没有真正全身心地投入到创造财富的事业当中,你可能就不会成功

        你获得的报仇取决于你给市场带来的价值比例

        富人关注机会,穷人关注困难
                回报        风险

        富人羡慕别的富人或成功人士
        穷人仇视富人和成功人士

        富人情愿提升自己和自身的价值

        领导者比他的追随者赚的钱要多得多

        富人比自己遇到的困难更强大
        穷人比自己遇到的困难更弱小

        成功的秘诀不是力图逃避困难,或在困难面前畏缩不前,而在于壮大自己,让
            自己变得比遇到的问题更强大

        富人选择以结果赚钱,
        贫人选择用时间赚钱

        永远不要为你的收入封顶

        富人想  两全其美
        穷人想  二择其一
        
        富人关心他们的净资产
        穷人在乎他们的工资

        富人让钱为其效力
        穷人为钱而卖力

        富人把一美元当成 种子 可以 种植  产出上百美元,这上百美元又可以重新
            种植 产出

        富人勇往之前
        穷人畏首畏尾

财富档案:
        富人认为,我创造生活.
        穷人认为,我遭受生活.










