网络互联:
        是指能够实现在两个连接在不同网络的终端之间的通信

        以太网      PSTN .... 之间的通信
        PSTN:
            识别方式: 电话号码唯一标识符
            通过呼叫过程建立点对点语音信道
            封装成ppp帧 无需节点的地址信息
            电路交换方式

        解决的问题:
                地址标识不同: 以太网是MAC地址
                               PSTN是电话号码
                帧格式不同:
                        mac帧
                        ppp帧
                无法直接建立传输路径:
                需要使用 路由器实现不同网络的连接
        路由器:
                需要有 mac地址
                电话号码
                负者格式转换


网络互联机制:
        









