原则：
    努力让自己更美好 让家人更美好  让生活更美好 让。。。。。更美好
    看别人的优点    欣赏的角度去看别人
    积极的看问题    积极的提问题
    make a difference
    permission to be human   接受自己 接受自己的情绪 主动接受自己
        主要是在于对于这种情绪的表达方式 处理方式  选择宽容 ...
    People mostly do what you do, rather than what you say
            多数人都是按照你做的做而不是按照你说的做


    环境对人的影响非常大：
            创造积极的环境， 挂个画 名言
            相信自己可以做到    continue ask  坚信可以
            一定要坚信 告诉自己
            当你坚信的和实际的有差异的时候：
                1 跟新模型
                2 忽略或抛开 这种差异
                3 主动验证


 




