Positive psychology:
    
Silence:
    反思 回忆一下 刚刚的学习 
    说白了就是 自己思考一下 经过自己的大脑

good question：
    积极的提问 看到自己的优势 看到别人的优势
    不要一直看到不足 一直关注于不足 你会更加抑郁
    欣赏优点也会增值
    欣赏缺点也会变得更加。。。

    Positive question  ask:
        为什么这么多孩子堕落 ？ 不积极的问法
        那些人是怎么取得成功的  
            为什么有一些可以成功即使成长环境恶劣
    
illness model:
    If wo take away the illness, then we become healthy.
Positive mode: healthy model
    You are ill because you don't have enough health in your life.
    because you are not prsuing those things that make you healthy.
        What make you healthy? pursuing meaning, purpose; 
                            cultivating healthy relationships
Stop blaming others, Take responsibility for your life.
    

指数函数增长：
    纸叠41次可以到达月亮
    象棋    
    make a difference   指数传播 该可以改变很多

幸福六个月恢复原来水平：   
    当你一个人中彩票 得到某个职位 出车祸残疾 六个月恢复自己原来幸福水平

政治对人性的观点：
    一种认为 人性是不能改变的 要引导
    一种认为 人性是可以改变的 要改变        
            所以政策不同
        保持：  人性是不能改变的 要接受 理解它 应用它
            接受自己 一直压制会更强

负面影响：
    下行螺旋    一直下降    越来越消极

    积极情绪    上行螺旋    越来越快乐  创造力提高 有人接触更好

People mostly do what you do, rather than what you say
    多数人都是按照你做的做而不是按照你说的做

环境对人的影响非常大：
    创造积极的环境， 挂个画 名言
        犯人实验    自我心里暗示

相信自己 you can do it      一定要自信相信自己
    一直努力        
使用积极的眼光看世界    乐观的眼光看世界  will be better
    屡败屡战    相信自己那只是暂时的失败  勇敢的面对现实  根据现实灵活应对

现实的自信 
盲目的自信
    不可取

幸福一直 起起落落 一直到在基点处徘徊
    所以提高幸福的方法是提高基点
        提高基点的方法
            面对他  把自己置位危险之中      幸福还是up and download 
                                            但是上升的
                            自我总结 我是一个勇敢的人 自尊水平上升
                            当经历过失败后 我们感觉不想我们想象的那么糟
                                当恢复到正常幸福水平 我可以应对它 
                                我一定是一个有适应力的人
如果变得更加乐观： 不是盲目的乐观  盲目的相信自己
    1 First is to take action; to just do it
            to put ourselves on the line
            失败后 才能看淡失败 感觉失败也就那么回事 更加从容 适应能力提升
                    自尊 自信提升

            当我们不允许失败的时候，会形成一个下降的螺旋 是自尊下降
    2 Second, I'm going to talk about the power of imagination
            想象自己成功后的场景 潜意识无法区别
            但也要想象 你成功的过程 通过自己努力 奋斗过程 成功场景
            构建美好的蓝图

    3 认知疗法  cognitive therapy
            Event - Evaduation - Emotion
                改变： Evaudation
                    如要归纳过度 一次考试考不好就说自己不行 不能考好
                    要看全部 不要视野过小 只关注一次    
                        隧道视野
                        归纳过度
                    改变对一件事的评估 理性的看待一件事

关注：
        关注创造现实        只关注汽车的人 而忘记还有什么
            消极者：关注自己的不成功
                    在天堂也能找到缺陷
                    潜意识创造了一个消极的世界
            积极者：
                    关注生活光明的地方
                    在乌云中也能找到一丝光明

                    明白世界上的事情不是都是好事， 我们需要扭转这些事情
                        我们需要时间
            乐观主义那么好，为什么不做呢：
                不切实际   媒体播放 现实世界 恐怖主义 。。。。负面消息
                他是一条放大镜(放到负面消息) 不是一个眼睛
                所以正视这个世界 不是关心媒体报道的问题 而是有个完整的认识

            感激，欣赏
                学会感激 欣赏 专注它

                适应性： 适应性有好的一面，让我们生活下来
                        但是也让我们感觉什么都习以为常
                        我门应该学会感激：我们的健康，我们的生活。。家人
                        感谢生活很多事情，关注他们

                        每天发现一些自己需要感激的事，每天关注一些
                            图像化 想象
                        没有关注的方向可以变一下 变化是生活的调味剂

改变：
        改变是很困难的，我们不应该问 为何如此困难 而应该问 如何改变
    类型：
        渐进型：
            每天 想象一下 感受一下
            安全区      拉伸区      恐慌区
            一点 一点 的过度    一点一点的改变
        突发式:

    改变的难点：
        自己大脑里面的一致性 阻碍你的改变
            将需要改变的性格 和 你的乐观的性格联系在一起 潜意识该不掉了
            完美主义 和 一致性基本一样


自律和例行公事：
        每个人的自律都是有限的  可以做下来的事情靠的是例行公事
            例行公事：就像刷牙一样
            建立例行公事需要大量的自律 每30天建立 一个例行公事 形成习惯
                建立申请通路 形成习惯
             
            自律是有限的 建立例行公事

重新审视自己的事情 换个角度看这些事情
        这些事情为了我的。。 对我有好处
            
写日记：
    记录你最焦虑的事情，刚开始的时候 可能会更加焦虑 但是多了几天就会降低到
        更低的水平
    记录生活美好的事情 写的越详细越好

    写下一个自己 便成为了一个story 人们便能应对合格story 









