面向对象的概念：包括
        用来构成系统模型的基本成分  成为建模元素
            建模元素：
                    对象 类 
                    属性 操作
                    继承关系        以及一般的特殊结构
                    聚合关系        以及整体的一部分结构
                    关联
                    消息
        在建模中需要遵守的某种原则 不代表任何建模成分
                    原则：
                        抽象
                            OO方法广泛运用的抽象原则
                                对象。。。
                        分类
                            把具有相同属性和操作的对象放到一起
                            使用类作为这些对象的抽象描述
                        封装
                        继承
                        聚合：
                        关联
                        消息通信：
                            通过消息进行通信
                        粒度控制
                            引入包的概念
                        行为分析：


模型以及其归约：
        在分析阶段和设计阶段建立的系统模型分别为OOA模型和OOD模型
            包括需求模型 基本模型 辅助模型
        需求模型：
                用况图
        基本模型：
                类图
                    类之间的关系
                    类的属性和操作
        辅助模型：
                对类图起辅助作用
                    顺序图
                    活动图
                    状态机图
        模型归约：
                堆上述各种模型图 进行归约 约定

    OOA模型框架：
                见图pic/2/ooa.png
            建模过程：
                这几个过程 时间上是比较随意的
                pic/2/ooa2.png

            抽象层次高
    OOD模型：
            建模过程：
                pic/2/ood2.png 
                见图pic/2/ood.png 
            抽象层次底

从MDA看OOA和OOD之间的关系：
            MDA： 模型驱动的体系结构
            模型驱动：是指用模型来对系统的理解 设计 构造 部署 操作 维护。。

        OOA先得到一个与平台无关的模型
        OOD设计成一个专用的模型
                

实战小游戏：
        









