什么是对象：
        哲学中的对象：
            客体:向对于客体而言。。。。。对象 包括人还有。。。。
            主体：是指对客体和实践能力的人

对象与结构：
        对象是一种结构  结构性质：
            整体性
            转换性
            自身调节性
                可以形成一个封闭的体系
        对象特征：
            内涵：。。。。。    属性的总和
            外延：。。。。。    
面向对象与基于对象：
        面向对象 可以允许用户使用以上全部的元素
        基于对象：用户无法定义一些派生的对象对象类


面向对象方法学：
        封装：
            将属性和操作接合在一起 形成不可分割的整体
        信息隐藏：
            private protected
面向对象的实例化：
        可以以类为模板。。
        可以并发处理        多个变量

抽象数据类型：
        封装 信息隐藏 与 实例化     。。。。便产生了面向对象

消息传递：
        消息传递 需要延迟   内存中运行需要时间。。传输需要时间。。。

泛化与多态：
        泛化关系是一种类之间的关系  可将一类对象进一步分为许多的子类 原来
            的类与子类之间的关系就是泛化关系
多态：
        接口复用
        和覆盖有关  效率损失。。。

重载：
覆盖：
        方法进行 覆盖

关联与聚合：
        关联是对象间链的集合

    聚合：
        用来描述对象之间的整体部分关系
        











