系统分析：
        建立结构
交互图：           静态图
        建立行为    
    交互：
        实例之间的  通讯集合

    1 建立动态模型
        行为分类：
            静态行为： 不被任何外部或内部时间所影响
            动态行为： 一般是多线程 多进程的。。。 事件驱动 状态图描述

    顺序图：
            使用对象 来表示 不使用类

    消息：
            两个对象 之间的通讯
            同步消息:
                    接收者做好准备接收
            异步消息:
                    接受者 放在队列。。缓存起来 然后再处理
            返回消息：
                    同步消息返回的消息


    顺序系统中的消息：
            一切操作都是按照顺序执行的
            消息都是同步的

    交互片段：
            组合片段：
                交互操作符  交互操作数

    通讯图：

    时序图：
            







