营养食物:
        水果类      蔬菜类      没有加工的谷类      豆类

吸收钙的能力:
        钙 磷比 越高 越容易吸收


吃素:
    1 不能吃的太油
    2 以清淡为主    不要吃太闲 太甜
    3 蛋白质不要吃太多  豆类的产品不要吃太多
    4 摄取坚果类来获得不饱和脂肪酸DHA
    5 不宜吃加工的素料 素鸡 素娥.... 因为有防腐剂
    6 根 茎 类 芽菜来 需要均衡吸收
        最好吃当地当季的食物    道法自然


食谱:   禁止:吃辣的 油腻的     尽量不吃肉
        多喝水  饮料:可以矿泉水 果汁
        不同的季节可以吃不同的食物

    坚果:
        每个 买点核桃
         
    早上:
        一个苹果
    中午:
        大米   蔬菜:尽可能 吃生的不同种类的 土豆  胡萝卜
        馒头   喝粥(可以和些豆类 八宝粥 小米 玉米...)     蔬菜(根茎叶均衡)

    4:30左右吃个香蕉        可以中午吃完饭买
    下午:
        和中午 基本一样


氨基酸              含该种氨基酸的植物
赖氨酸                  苹果,胡萝卜, 土豆,西洋菜, 梨,葡萄, 大豆,鬼针草,黄瓜,
                            芹菜,菠菜,杏仁,花生, 南瓜子,芝麻,淮山,

色氨酸                  胡萝卜,土豆,马齿苋,大豆,糙米,花生,
苯丙氨酸                苹果,胡萝卜,土豆,鬼针草, 马齿苋, 淮山,
蛋氨酸                  苹果,胡萝卜,土豆,鬼针草, 马齿苋,豆类,大蒜,洋葱, 淮山
苏氨酸                  苹果,胡萝卜,土豆,鬼针草, 马齿苋, 淮山,
异亮氨酸                苹果,胡萝卜,土豆,大豆,糙米, 淮山,
亮氨酸                  苹果,胡萝卜,土豆,马齿苋,香蕉,花生,淮山,
缬氨酸                  苹果,胡萝卜,土豆,鬼针草, 马齿苋, 淮山,

土豆 胡萝卜都含有       苹果就差了一种








