x86体系结构:
        指令改变:
            pic/16位.png
            pic/32位.png
            pic/64位.png 



        指令分类举例:
            传送指令:
                mov 指令
                    寄存器
                    内存单元
                    立即数
            栈操作指令:
                push 指令
                pop 指令
            算术运算指令:
                加减乘除
                ADC指令 带进位的加
                inc 加1指令

                SBB指令 带借位的见
                edc指令 减1

                cmp 指令 比较
            逻辑运算指令:
                not 
                and
                shl 左移

                shr 逻辑右移
                SAR 算术右移 带考虑符号位
            转移指令:
                无条件
                    jmp 

                条件转移:
                    检查某个标志位 转移
            处理器控制指令:


            串操作指令:
                对存储器中的数据串进行每次一个元素操作
                串的基本单位是字节或字
                串长度可达64kb

            循环控制指令:
            
            查表指令:
                XLAT


MIPS体系结构:
        精简指令系统

        MIPS指令特定:
            固定指令长度  32bit
            简单的寻址模式
            指令数量少 指令功能简单
            只有load和store指令可以访问存储器   





