连续系统的时域分析：
    连续系统的响应：
        微分方程的经典解：
            完全解 = 齐次解 + 特解
                齐次解： 方程为0时的解
                    和系统的特点有关        输入信号按照什么变化
                特解：   代入求解
                    和输入的信号有关        具体信号 

        求解微分方程分为三个过程：
             1 求齐次解
                    令方程为0 确定系统变换的特征
             2 求特解
                    设 特解代入 因为齐次解为0 不用管了 
                        求处输入信号的变化规律
             3 确定的系统初始状态
                    代入几组 值 变可以求出来

        用系数匹配法求解 初始值:
            。。。。。

    零状态响应：
        状态为0 
    零输入响应
        输入为0
        都可以使用 经典微分求解方法来求解


动态系统：
    线性系统：  满足下面几个条件
        可分解性：
            全响应 = 零输入响应+零状态响应
        零状态线性：
            函数值相加等自变量相加后的函数值     状态为0
        零输入线性：
            tongli 

时不变系统：
        输入延迟多少时间 响应也延迟多少时间

因果系统：
    零状态不会出现 响应之前的系统

稳定系统：
    

系统的分析方法：
        输入输出法
            时域分析
            变换域分析
                连续系统
                离散系统
        状态变量法
        





