傅里叶变换 和 系统的频域变换：
        时域分析(时间为自变量) 以脉冲函数为基本信号 任意输入信号都可以 
            分解为 一系列的脉冲函数之和  
            对于一个系统 先求出 脉冲函数的响应 然后在 求解输入信号的响应
                利用到卷积 来求
        频域分析(自变量为频率)： 选择正玄信号或复指数函数为基本函数 
            将任意输入函数分解为    一系列不同频率的正玄信号或虚指数
                函数之和

    正交矢量：
            内积为0 
    正交集：
            两两正交
    正交信号：
            两个函数在一定的定于域内　相乘在这个定义域内的积分为０
    正交信号集：
            两两为正交
    正交完备集：
            找不到其他的函数　与这个集合中的每个函数都正交
            例如：
                正交三交函数集
                虚指数函数集
正交函数集：
    傅里叶级数      两种基本的傅里叶展开
            正玄函数
            虚指数函数集
             
傅里叶变换：
        所选正交集：
            三角函数集
        满足dis。。。条件才能分解为傅里叶级数
            在一个周期内：
                    可积
                    极大值 极小值有限
                    间断点有限
        可以表示为傅里叶变换：
            可以表示 一个正玄分量   余弦分量 
            公式
信号可以通过傅里叶变换：
        信号的奇偶性在 傅里叶中的表现：
            如果信号是个偶函数的话：
                展开的傅里叶级数    只有余弦分量
            如果信号是个奇函数
                展开的傅里叶级数    只有正玄分量
        奇斜函数：
            在函数一个周期内  从周期的中间划开  平移左边的到右边
                    如果函数重复 则是偶斜函数 
                        傅里叶展开 只有偶分量 没有奇分量
                    否则： 为奇斜函数
                        傅里叶展开 只有奇分量 
周期信号的功率：
        展开傅里叶级数
        信号的功率等于 在正交分解后的 正交集中的每个分量的和

        正玄函数的有效值。。。。 叠加性 不存在的


周期信号的频谱:
        使用 图形的形式来描述一个函数
        一个周期信号 使用傅里叶展开后 使用正玄 余弦来表示了 但每个子频率不同
        所以 
            振幅图：
                频率为x轴 幅度为为y画图   
            相位图：
                         相位为y轴
    特点：
        离散型：
            离散的点上有值
        谐波性：
            间隔 均匀
        收敛性：
            频率趋向无穷大  大小趋向为0
复指数信号的频谱：
       幅频特性：
            对称
       相位特性： 
            duicheng 
        
            













