离散系统的时域分析：
                    连续                    离散
描述                微分方程              差分方程
求解              经典解 全解=特+齐次       也有相识的 
系统分析          卷积运算。。              也有相识的
运算               卷积积分                 卷积和
基本信号            阶跃 冲激               阶跃 冲激
基本响应        。。。。


线性离散系统的分析：        在时间域上 时间为变量

        差分与差分方程：
            差分：
                相当于 连续系统的微分
            差分方程：
                有移位序列组成
                可以使用 递推 可以求解很多的值
                经典解：
                    响应=齐次解 + 特解 
                        和连续系统求解方式 基本一样
                    具体求解 公式。。。

        全响应 = 零输入响应+零状态响应
        求解：  下面的两个响应  也可以使用经典解
        零输入响应：
            使用经典解来求解：
                使 关于输入的信号都为0  在求解 一般就是求解个齐次解
        零状态响应：
                状态为0   齐次解+特解


    卷积和运算：
        任意序列下的零状态响应：
            卷积： 分解法
                    图解法
                        换元
                        反转
                        平移
                        乘积
                        求和
                    不进位乘法求积分
        卷积和性质：
            交换律：
            结合率：
            分配律：

    复合系统：
    












