信号的时域分析：
    
    信号的分解：
        0 号脉冲 n号脉冲可以使用公式表达
        f(t) 可以分解为 一系列 脉冲函数的组合
        f(t) = f(tao)*脉冲函数的tao-t的积分

    任意信号作用下的零状态响应：

    卷积积分：
        定义：
            卷积积分的三种形式的积分 
                负无穷到正无穷
                0 - t
                负无穷 - t

    P算子分析算法：
        微分算子 及系统的描述
        微分算子的dingyi：
            Ｐ定义为一种求导的运算
        积分算子：
            P分之一


    微分算子的性质：
        P的多项式可以 因式分解
        可以先积分在微分
        不可先微分在积分


    系统的传输算子：
            y(t) = H(p)f(t)
            那么H(p)便是传输算子

            H(p)表达了系统的特性
    RLC微分算子方程的建立：
        。。。。


    求零输入相应的一般方法：
            A(P)y(t) = 0
            1 对A(p)因式分解
            2 求每个因式所对应的零输入相应
            3 y等于各因式对应的零输入响应之和
            4 用初始值确定系数

    零状态响应求解方法：
            一 求解h(t)     再求卷积
            二：


零输入 零状态 求解方法：
        前面有一般放
            经典微分方程求解
            还有其他的一个
        使用p算子之后的求解方法：
            上面有一个
            还有。。。

