真实感图形:
        1 建立三维场景
        2 消隐 物体之间关系
        3 光


        颜色模型:
            计算机描述颜色的方式:
                RGB颜色模型:
                    RGB     red green blue
                视觉颜色模型:   从人的视觉角度
                    色调    饱和度  亮度
                    色调:由物体反射光线中占优势的波长决定的
                    饱和度:彩色的深度程度   饱和度越低 白色光越少 彩色越深
                    亮度: 光的亮度

        光照模型:
                简单光照模型:
                    只考虑光源对物体直接光照
                    Phone 光照模型: 环境光 漫反射光 镜像反射
                    增量光照模型:










