系统：
        相关联的实物  具有特定的功能 组成的整体

信号：
        是信息的一种物理体现

        电信号
        非电信号

    信号的分类：
        确定信号：
            可以写出方程式
        随机信号：
            噪声


        连续信号：
            变量是连续的
        离散信号：
            变量是离散的

        周期信号：
        非

信号的基本运算：
        加 减 × 

        反转
            f(t )-> f(-t)
            关于y轴对称
        平移：
            t  ->  t-1
            左加右减

            所有的运算都是 针对t运算的
        尺度变换：
            a  ->  at
                t > 1
                    压缩
                t < 1
                    扩展

            先 平移 再 压缩 在反转
            一切运算都是 针对t运算的

阶跃函数：
            0  t < 0        3(t)
            1  t > 0
            可以经过 基本函数的运算 表示各种其他的函数
                    可以表示： 方波函数
冲激函数：
            0   t 不等于 0
            R上积分为1

            和其他函数的乘积 求积分 为另一个函数0处的值
            取样性质：t-a     积分之后  等于 函数a处的值

    冲激函数的倒数：
         求 冲激函数和普通函数的乘积：
                公式：  （-1）n * fn(0)
    推论：
        扩展 f(at)  1/af(t)
        移动
    复合函数式的冲激函数：
        冲激函数的自变量是 一个 普通函数
            带公式  f（t） 有重根没有意义  
                    等于　








